{
    "I18N": {
        "LANGUAGE": "Español",
        "MAINTAINERS": "@Viriato139ac#0342"
    },

    "COMBAT_CAROUSEL": {
        "SETTINGS": {
            "AboutN": "Acerca de",
            "AboutH": "Información acerca de Combat Carousel (Carrusel de Combate)",
            "EnableModuleN": "Habilitar Combat Carousel",
            "EnableModuleH": "Habilita las funcionalidades del módulo",
            "OverlayConfigH": "Abrir formulario de configuración de tarjeta de contendiente",
            "CollapseNavN": "Ocultar la barra de navegación",
            "CollapseNavH": "Pliega la barra de navegación al mostrar el Carrusel de Combate",
            "ShowBar1N": "Mostrar barra 1",
            "ShowBar1H": "Muestra la barra de recursos (si está configurada). Opciones: Siempre: mostrar siempre la barra (si existe alguna). Contendiente activo: solo mostrar la barra del contendiente activo. Al pasar el ratón: mostrar solo la barra al pasar el ratón por encima. Nunca: no mostrar nunca las barras. Nota: es posible que otros ajustes del GM puedan restringir la visibilidad de las barras",
            "Bar1PermissionN": "Permisos de jugador de la barra 1",
            "Bar1PermissionH": "Define las circunstancias en las que se muestra la barra 1 a los jugadores. Todos: mostrar las barras de todos los contendientes. Propios: se mostrarán solo las barras de los iconos para los que el jugador tenga permisos de propietario. Observador: bse mostrarán solo las barras de los iconos para los que el jugador tenga permisos de observador. Ninguno: no mostrar ninguna barra a los jugadores",
            "ShowOverlayN": "Mostrar tarjeta",
            "ShowOverlayH": "Muestra la tarjeta (si se ha configurado). Opciones: Siempre: mostrar siempre la tarjeta. Contendiente activo: solo mostrar la tarjeta del contendiente activo. Al pasar el ratón: mostrar solo la tarjeta al pasar el ratón por encima. Nunca: no mostrar nunca las tarjetas. Nota: es posible que otros ajustes del GM puedan restringir la visibilidad de las tarjetas",
            "ShowEffectsN": "Mostrar efectos",
            "ShowEffectsH": "Mostrar los efectos activos en el Carrusel. Funciona mejor si los efectos activos se usan para mostrar condiciones u otro propósito similar. All: Muestra todos los efectos. None: No muestra ninguno. Active: Solo los efectos activos. Active and Passive Effects: Muestra los efectos que son o bien activos o pasivos (esto es, ignora los efectos no activos)",
            "OverlayPermissionN": "Permisos de jugador de la tarjeta",
            "OverlayPermissionH": "Define las circunstancias en las que se muestra la tarjeta a los jugadores. Todos: mostrar las tarjetas de todos los contendientes. Propios: se mostrarán solo las tarjetas de los iconos para los que el jugador tenga permisos de propietario. Observador: bse mostrarán solo las tarjetas de los iconos para los que el jugador tenga permisos de observador. Ninguno: no mostrar ninguna tarjeta a los jugadores",
            "Bar1AttributeN": "Atributo de la barra 1",
            "Bar1AttributeH": "Ruta el atributo de actor que se debe usar en la barra. Si solo se pone un atributo con valor único solo se mostrará un único valor. Si se especifica un atributo con un valor que tenga una propiedad de máximo se mostrará un medidor que se irá vaciando a conforme el valor desciende (p.ej. salud)",
            "Bar1TitleN": "Nombre de la barra 1",
            "Bar1TitleH": "Nombre a mostrar en la barra (p.ej. PV)",
            "ShowInitiativeN": "Mostrar iniciativa",
            "ShowInitiativeH": "Mostrar el valor de iniciativa (si es que existe). Opciones: Siempre: mostrar siempre el valor (si existe). Contendiente activo: solo mostrar el valor del contendiente activo. Al pasar el ratón: mostrar solo el valor al pasar el ratón por encima. Nunca: no mostrar nunca el valor",
            "ShowInitiativeIconN": "Mostrar icono de iniciativa",
            "ShowInitiativeIconH": "Muestra el icono de iniciativa (si es que existe). Opciones: Siempre: mostrar siempre el icono (si existe). Junto con el valor de iniativa: muestra el icono cuando se muestra la iniciativa. Solo los contendientes que no han tirado: muestra los iconos cuando el contendiente no tiene valor de iniciativa. Nunca: no mostrar nunca el icono",
            "InitiativePermissionN": "Permisos de jugador de la iniciativa",
            "InitiativePermissionH": "Define las circunstancias en las que se muestra la iniciativa a los jugadores. Todos: mostrar las iniciativas de todos los contendientes. Propios: se mostrarán solo las iniciativas de los iconos para los que el jugador tenga permisos de propietario. Observador: bse mostrarán solo las iniciativas de los iconos para los que el jugador tenga permisos de observador. Ninguno: no mostrar ninguna iniciativa a los jugadores",
            "ImageTypeN": "Imagen de contendiente",
            "ImageTypeH": "Seleccione la imagen que debe usarse para los contendientes en el carrusel. Opciones: Actor: la imagen del actor. Icono del actor: la imagen del icono del actor (mostrará la imagen del actor si no se ha configurado una imagen de icono). Icono: la imagen del icono",
            "CarouselSizeN": "Tamaño del carrusel",
            "CarouselSizeH": "El tamaño del carrusel en la pantalla. No se rescalarán los elementos de control ni el HUD",
            "ControlActiveCombatantTokenN": "Controlar icono del contendiente activo",
            "ControlActiveCombatantTokenH": "Habilita el control automático (seleccionar) del icono asociado al contendiente activo actualmente",
            "PanOnClickN": "Centrar al hacer clic en una tarjeta",
            "PanOnClickH": "Se centra en el icono correspondiente cuando se hace clic en una tarjeta (nota: el icono debe ser 'visible' para el usuario actual)",
            "AlwaysOnTopN": "Siempre visible",
            "AlwaysOnTopH": "Mostrar el carrusel siempre encima del resto de elementos de la UI",
            "OpenOnCombatCreateN": "Abrir Combat Carousel al crear un combate",
            "OpenOnCombatCreateH": "Abre el carrusel cuando se crea un combate"
        },

        "CAROUSEL": {
            "NextTurn": "Turno Siguiente",
            "PreviousTurn": "Turno Anterior",
            "NextRound": "Asalto Siguiente",
            "PreviousRound": "Asalto Anterior",
            "NextRoundTooltip": "Clic para pasar al Asalto Siguiente",
            "PreviousRoundTooltip": "Clic para volver al Asalto Anterior",
            "ToggleHint": "Clic para ocultar/mostrar, clic-derecho para ajustes",
            "EndEncounter": "Clic para finalizar el encuentro",
            "DragTooltip": "Clic y arrastre para mover, clic-derecho para volver a la posición original",

            "Controls.CreateEncounter": "Crear encuentro",
            "Controls.DeleteEncounter": "Borrar encuentro",
            "Controls.NextEncounter": "Encuentro siguiente",
            "Controls.PreviousEncounter": "Encuentro anterior",
            "Controls.RollAll": "Tirar iniciativa",
            "Controls.RollNPCs": "Tirar para PNJs",
            "Controls.ResetAll": "Reiniciar iniciativas",
            "Controls.EncounterConfig": "Ajustes del asistente de combate"
        },

        "COMBATANT_CARD": {
            "ActiveTurn": "Turno activo",
            "Controls.Hide": "Alternar visibilidad",
            "Controls.Defeated": "Marcar como derrotado",
            "Controls.Remove": "Quitar del encuentro",
            "RollInitiative": "Clic para tirar",
            "EditInitiative": "Clic para editar, clic-derecho para reiniciar (solo GM)"
        },

        "ABOUT.Label": "Acerca de Combat Carousel (Carrusel de Combate)",

        "CONFIG_FORM.ResourceBars": "Barras de recursos",
        "CONFIG_FORM.ResourceBar1": "Barra de recursos 1",

        "OVERLAY_CONFIG.Title": "Carrusel de Combate | Configuración de tarjeta",
        "OVERLAY_CONFIG.Name": "Configuración de tarjeta",
    
        "TOGGLE_BUTTON.Tooltip": "Carrusel de Combate - clic para alternar visibilidad, clic-derecho para reiniciar posición",

        "WORDS": {
            "Save": "Guardar",
            "Cancel": "Cancelar",
            "Hidden": "Oculto",
            "Defeated": "Derrotado",
            "Encounter": "Encuentro",
            "Round": "Asalto",
            "Turn": "Turno",
            "Property": "Propiedad",
            "Name": "Nombre",
            "Value": "Valor",
            "BrowseFiles": "Explorador de archivos"
        }
    }
}
